/**
 * 
 * 排序算法有比较算法和非比较算法。
 * 
 *           －－非原址算法（空间复杂度较高）：如归并排序，在归并的时候，需要新建数组，归并排序最坏和平均时间复杂度θ(nlgn)
 *          ｜
 * 比较算法－－
 *          ｜          －－插入排序,最坏和平均性能均是θ(n*n)
 *           －－原址算法 －－堆排序，最坏性能O(nlgn)
 *                      －－快速排序（实际应用中，快速排序往往比堆排序的性能要快），最坏θ(n*n)，平均性能θ(nlgn)
 * 
 * 比较算法的时间复杂度不会小于nlgn。
 *  归并、堆排序、快速排序都使用了经典的分治策略，因此子规模都是指数级减少，因此时间复杂度都有lgn。
 *  但是快速排序因为将最小的放最左边，最大的放最右边，在最坏情况下，没有达到分治的效果，因此只有θ(n*n)。
 *  
 *  
 *  非比较排序可以在线性时间内完成排序，有计数排序、基数排序、桶排序等。
 *  
 * @author skyouth
 * 
 * 2016年9月5日
 *
 */
package algorithm.sort;